{
    "collect": [{
        "Title": "Plutus",
        "Category": "uidesign",
        "Cover": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/plutus-thumbnail.jpg",
        "Description": "Plutus is an app that helps you manage your credit card. Whether it is from the most basic credit cards recommendation, to the credit cards discount offer organize, or even to recommend best deals based on the stores near you or consumption habits, this is a tool that can maximize the value of your credit card and give you best shopping advice.",
        "Info": [{
            "Name": "Platoform",
            "Content": "APP"
        },{
            "Name": "Responsibility",
            "Content": "UI/UX Design"
        },{
            "Name": "Tools",
            "Content": "Figma"
        },{
            "Name": "Figma Link",
            "Content": "<a href='https://reurl.cc/4mYM6j' target='_blank'>https://reurl.cc/4mYM6j</a>"
        }],
        "Content": [{
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/plutus.jpg"
        }, {
            "mode": "text",
            "text": "Plutus is an app that helps you manage your credit card.<br>Whether it is from the most basic credit cards recommendation, to the credit cards discount offer organize, or even to recommend best deals based on the stores near you or consumption habits, this is a tool that can maximize the value of your credit card and give you best shopping advice.<br>Our target audience is fresh graduate, therefore, we choose a design language that is closer to the young people, like using lively color, and more importantly, a smooth and fast user experience without overly complicated decoration.<br>At the same time, we also position this software as a tool that will be frequently used, so I do some competitor analysis, and also refer to the design guidelines of mobile as much as possible, let user easy to get started with it."
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Information Architecture",
            "text": "After entering the app, I chose to use the bottom navigation for the first layer of architecture, which allows users to navigate in a more intuitive and convenient way. At the same time, clear naming will also guide users to find which tab the function they want is located. As shown in the figure at right, our architecture design is broad and shallow. We think that users will use this APP more frequently and tend to be daily tools. Therefore, we hope that most of the steps, especially in some deals search or recommendation function, the fewer clicks you need to make each time you use it, the better.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/plutus-arch.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "Main Function",
            "text": "<b>View stored credit card information</b><br>In the card list above, you can click the left or right button to switch cards, and view the basic information & benefits of this credit card below.<br><br><b>Add card</b><br>Users can add a credit card by clicking the Add Card button at the top left.<br><br><b>Search for deals</b><br>Click search deals at the top right will enter the search interface, allowing the user to search through all the credit card offers he currently has.<br><br><b>Nearby offers</b><br>The following shows the discount information closest to the current location, so that users can know how to spend effective and maximize the value of your credit card. At the same time, it will also be accompanied by notification, which can remind users even if the app is not open.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/plutus-feature.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Card Recommendation",
            "text": "<b>View popular cards</b><br>We can count the most popular cards based on the records of all users' newly added cards, plus some labeling such as age, gender, etc., to make the basic recommendation for users.<br><br><b>Answer questions to get exclusive recommendations</b><br>After pressing the “Start Search Now“ button, the App will ask you a series of questions, and at the end will recommend the most suitable card based on your answers, so that you can get the most useful offers.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/plutus-recommand.png"
        }]
    },{
        "Title": "Ins.Keeper",
        "Category": "uidesign",
        "Cover": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-thumbnail.jpg",
        "Description": "Ins.Keeper is a recommendation website for insurance portfolios. Users can obtain recommended through two ways - “Tailored Planning“ or “Selected Portfolios“. After selecting the portfolio they like, they can contact the sales through the system.",
        "Info": [{
            "Name": "Platform",
            "Content": "Website"
        },{
            "Name": "Responsibility",
            "Content": "UI/UX Design"
        },{
            "Name": "Tools",
            "Content": "Figma, Zeplin"
        },{
            "Name": "Figma Link",
            "Content": "<a href='https://reurl.cc/odm3A5' target='_blank'>https://reurl.cc/odm3A5</a>"
        }],
        "Content": [{
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper.jpg"
        }, {
            "mode": "text",
            "text": "Ins.Keeper is a recommendation website for insurance portfolios. Users can obtain recommended through two ways - “Tailored Planning“ or “Selected Portfolios“. After selecting the portfolio they like, they can contact the sales through the system.<br>In the “Selected Portfolios“, users will be asked to fill in their birthday, gender, occupation category, and choose one of eight popular planning purposes, finally get popular portfolios to users through these questions.<br>In the “Tailored Planning“, beside basic information such as birthday and gender, user will also need to choose the types of insurance they wants and the conditions that they cares about, which we call it the “Insurance Lab“.<br>The more challenging part of this case is that it involves a lot of domain knowledge in insurance, so there are many unexpected needs to be considered in the communication process, and also have to be careful about usability becaurd of potential elder user. It's a case that let me gained a lot of experience. "
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-guideline.png"
        }, {
            "mode": "text",
            "text": "The main mission of visual design is to convey professional and stylish image. Although the layout use a more traditional typesetting method, the selection of shadows is more extensive and lighter, creating a sense of floating, at the same time I use line and geometric styles in Icon and components design, trying to get rid of the boring and old-fashioned image of insurance products. In terms of image selection, it focuses on bringing in a sense of immersion, such as the selection of images on the homepage, hoping to hit the target audience and make them feel that they are suitable for this type of product, eventually want to learn more about it."
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Navigation",
            "text": "For the selection of the navigation UI, in the first layer of the structure, I choose to use the fixed header, use the font weight and color to distinguish the selected items, and add decorative lines above the header to continue the elegance image of the website. while in In “Tailored Planning“ and “Selected Portfolios“, we using Icon with text to let user switching between each step, which also uses a line style to match the overall design vocabulary of the website.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-navigation.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "Recommended List",
            "text": "In the recommendation list, in addition to displaying the various conditions of the policy, the client hopes to allow users to easily compare the differences between various policies, so we used a table with a fixed header, which have the basic policy information and selection button inside, and the amount will displayed in the table, using tooltip to presented description, so that users can easily view the basic information while browsing the policy conditions, price, and even select policies.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-list.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Tailored Planning",
            "text": "In the first step of tailored planning mode, the user must enter the basic information and select the insurance type they want. The client hopes to explain the questions related to the insurance type to the user, so as to help the user understand the insurance better. And because we don't have a lot information to input, so I divided the page into two. On the right, users can change the content as the user selects different insurance types, than instantly select a question and view the answer through the drop-down menu, meanwhile stay on the same screen without swiping up and down.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-info.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "Insurance Lab",
            "text": "The “Insurance Lab“ is the most special function of this case. The owner hopes to make the user feel like ”adjusting the portfolio's content by himself” through the interface design of the filter conditions, so we named it the “Insurance Lab“.<br>After the user enters the “Insurance Lab“, they can see that there are several options waiting to be choose. By selecting option, it means agreeing and wishing to have this condition. Also they can move the mouse to the question mark icon in the upper right corner to get more explanation of this condition. In other hand, if the option is not selected, it means that you don't agree or don't care. If the options are mutually exclusive to the condition user has selected, it will be semi-transparent and cannot be clicked.<br>The important part is, number of products reamin and the minimum amount will displayed at the top of the screen and change immediately as the user change conditions, so the user can freely adjust the ideal content and minimum amount by trying different options, and ensure that these options can finally filter out the products.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-lab.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Trial Calculation",
            "text": "After selecting an insurance portfolio, the user will first enter the trial calculation screen, simulate several cases to see how many claims can be obtained before send the order, make sure they were satisfied. The main requirement here is to select different events, so it can be inferred that the user will frequently switch back and forth between events, so we use the same method as the explain insurance type part which we discuss before, that is a dropdown with a real-time change content, detailed the total amount of claims and the amount of each insurance claim in the policy for users' reference.",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/inskeeper-calc.png"
        }]
    },{
        "Title": "College of Communication PhD Program Official Website",
        "Category": "webdev|uidesign",
        "Cover": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/comm-thumbnail.jpg",
        "Description": "The Ph.D. program of College of Communication in National Chengchi University hopes to separate their website from the College and make it their own official website. So I first went through a meeting to confirm their requirements, reviewed the original architecture and functions under the official website, re-planned a new information architecture, then made a new visual design perposal, and finally completed the development.",
        "Info": [{
            "Name": "Platform",
            "Content": "Website"
        },{
            "Name": "Responsibility",
            "Content": "UI/UX Design, Front-end Development"
        },{
            "Name": "Tools",
            "Content": "Figma, HTML/CSS/jQuery"
        },{
            "Name": "Link",
            "Content": "<a href='https://ccphd.nccu.edu.tw' target='_blank'>https://ccphd.nccu.edu.tw</a>"
        }],
        "Content": [{
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/comm.jpg"
        }, {
            "mode": "text",
            "text": "The Ph.D. program of College of Communication in National Chengchi University hopes to separate their website from the College and make it their own official website.<br>So I first went through a meeting to confirm their requirements, reviewed the original architecture and functions under the official website, re-planned a new information architecture, then made a new visual design perposal, and finally completed the development."
        }{
            "mode": "imgtl",
            "withTitle": true,
            "title": "首頁",
            "text": "首頁使用圖片搭配大面積的logo，利用視覺帶給使用者強烈的第一印象，下方則依序陳列系所的特色、最新消息，以及更進一步的特色介紹如歷史背景等，用一個導覽員的方式向使用者介紹這個系所。<br><br>特色介紹區塊選用相關圖片搭配說明文字，讓有興趣的使用者可以詳細了解，想要大致瀏覽的人也可以看標題和圖片知道這個系所的特色。<br><br>圖片選用部分盡量選擇暖色調，搭配橘色維持配色的一體性。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/comm-index.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "課程手冊",
            "text": "課程手冊許多系所網站都是設計成直接下載pdf的方式，但大部分使用者往往只是想要找整份文件裡面其中的一兩條，卻要每次想看的時候都重複下載整份文件，十分不方便。<br>因此這邊設計成直接用線上瀏覽的方式檢視，並搭配目錄讓使用者可以快速找到需要的資訊，不必一定要先下載回來再慢慢翻，但如果有下載的需求當然也可以透過按鈕下載整份文件。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/comm-documents.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "博士學生",
            "text": "博士學生的需求除了展示學生的個人資訊外，也要陳列每個學生的專長，另外希望可以用搜尋和年級篩選的方式找到想要的學生。<br>這邊設計一個年級filter外，利用輸入框的方式讓使用者即時搜尋，關鍵字包含姓名、專長，不管是中英文皆可，更方便的找到想找的學生。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/comm-studs.png"
        }]
    },{
        "Title": "MileLync",
        "Category": "uidesign",
        "Cover": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-thumbnail.jpg",
        "Description": "MileLync is a project entrusted to me by CloudMile Inc. This platform provides consulting for GCP services. The main requirement is to let customers report their needs in the platform, and then the technical consultant will reply and solve them. In this project, the client proposed a structure, and I designed the screen layout according to the proposal, so that the screen and process could be more in line with the needs of users, and at the same time improve the aesthetics of the screen.",
        "Info": [{
            "Name": "Platform",
            "Content": "Website"
        },{
            "Name": "Responsibility",
            "Content": "UI Design"
        },{
            "Name": "Tools",
            "Content": "Figma, Zeplin"
        },{
            "Name": "Figma Link",
            "Content": "<a href='https://reurl.cc/VXnv15' target='_blank'>https://reurl.cc/VXnv15</a>"
        }],
        "Content": [{
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync.jpg"
        }, {
            "mode": "text",
            "text": "MileLync is a project entrusted to me by CloudMile Inc.<br>This platform provides consulting for GCP services. The main requirement is to let customers report their needs in the platform, and then the technical consultant will reply and solve them.<br>In this project, the client proposed a structure, and I designed the screen layout according to the proposal, so that the screen and process could be more in line with the needs of users, and at the same time improve the aesthetics of the screen."
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/MileLync-styleguide.png"
        }, {
            "mode": "text",
            "text": "配色以搭配Logo顏色為主，挑選深藍色為主色，橘色為輔色，並取各顏色深淺一階，共六色作為主要配色。準則上針對各元件進行定義，包括按鈕、選擇、各式輸入框等，讓工程師開發過程更加順暢。"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Home(客戶端)",
            "text": "首頁針對客戶的各項產品狀態和帳單狀態進行總覽，上方展示客戶的帳單費用增減情況，除了用大面積的折線圖將資訊視覺化外，同時提供平均花費和上期花費，以及和上月份的比較。左下方利用圓餅圖顯示該專案在當月中使用的各項服務佔總費用的比例，讓客戶能夠一眼找到哪些產品花費的金額比較高。右下方則是顯示客戶提出的tickets的概覽，包含近三筆、提出/解決數等。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-home.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "Support Centre(客服端)",
            "text": "此處的需求是呈現tickets和其相關的資訊，考量到要顯示的資料不少，因此針對資訊做一些分類簡化，譬如編號的部分使用者只有在少數的情況下才用得上(例如通過人工聯繫方式時)，因此預設為隱藏，待使用者滑鼠移至上方再顯示。優先程度和狀態也以顏色標籤來區分，讓使用者能夠迅速排定處理的順序，且同時盡可能地把欄位留給標題。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-supportcentre.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Billing(客服端)",
            "text": "帳單介面的業務邏輯比較複雜，會由客服端先上傳各項帳單後，先交由帳單人員審核完，再整包寄給客戶。客服人員先從此介面上傳檔案，完成後按下Approve按鈕，交由帳單人員確認，確認完成後再由客服人員按下傳送按鈕送給客戶。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-billing.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "Create a Ticket(客戶端)",
            "text": "客戶先選定要提問的產品後，填寫標題、問題內容、專案id和優先度，也可以選擇上傳檔案，完成編輯後提交給客服人員處理。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-createtickets.png"
        }, {
            "mode": "imgtl",
            "withTitle": true,
            "title": "Ticket(客服端)",
            "text": "點進Ticket後，此處盡量將資訊呈現在同一個畫面中，避免在來回對話中還要上下滑動去檢視資訊，同時也是考量到這個是大多應用情境在辦公室中的系統，螢幕預期會比一般人來得大，因此採用左右兩側的分割設計，左側顯示ticket相關資訊和內容，右側提供兩端進行對話，解決問題。客服人員在此畫面除了回覆外，可以選擇發送時間、附加檔案、標記其他用戶等功能，藉此解決客戶問題。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-ticket.png"
        }, {
            "mode": "imgtr",
            "withTitle": true,
            "title": "FAQ(客戶端)",
            "text": "FAQ針對各項主題整理問題，列表上顯示問題，展開後顯示問題的解答。亦有提供搜尋架構，輸入關鍵字後即時顯示搜尋結果。",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/milelync-faq.png"
        }]
    },{
        "Title": "Ms.300K Official Website",
        "Category": "uidesign",
        "Cover": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k.jpg",
        "Description": "Ms.300K is a outsourcing company founded by me and three university classmates, mainly take website and APP development cases. This is the official website designed and will develop by me for the company, showing the experience and portfolio, also providing the contact channel for portential clients.",
        "Info": [{
            "Name": "Platform",
            "Content": "Website"
        },{
            "Name": "Responsibility",
            "Content": "UI/UX Design"
        },{
            "Name": "Tools",
            "Content": "Figma, HTML/CSS/jQuery"
        },{
            "Name": "Figma Link",
            "Content": "<a href='https://reurl.cc/LdeGG3' target='_blank'>https://reurl.cc/LdeGG3</a>"
        }],
        "Content": [{
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k.jpg"
        }, {
            "mode": "text",
            "text": "Ms.300K is a outsourcing company founded by me and three university classmates, mainly take website and APP development cases.<br>This is the official website designed and will develop by me for the company, showing the experience and portfolio, also providing the contact channel for portential clients.<br>The main idea of the branding is hoping to give the client a novel and lively first impression, emphasizing that product build by us will be very modern and friendly in appearance and process."
        }, {
            "mode": "text",
            "text": "首頁"
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k-index.png"
        }, {
            "mode": "text",
            "text": "作品集"
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k-portfolio.png"
        }, {
            "mode": "text",
            "text": "作品內容"
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k-detail.png"
        }, {
            "mode": "text",
            "text": "接案經歷"
        }, {
            "mode": "img",
            "img": "https://ms300k-han.s3-ap-northeast-1.amazonaws.com/project-image/ui-design/ms300k-timeLine.png"
        }]
    }]
}